Data/TestFiles/cases/SimpleHeatFin/case/0/FluidProperties/T
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/FluidProperties";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{
    wall001
    {
        type        zeroGradient;
        value       $internalField;
    }

    inlet
    {
        type        inletOutlet;
        inletValue  uniform 293.0;
        value       uniform 293.0;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform 293.0;
        value       $internalField;
    }


    FluidProperties_to_heatsink
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
