Data/TestFiles/cases/SimpleHeatFin/case/0/FluidProperties/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/FluidProperties";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000.0;

boundaryField
{
    wall001
    {
        type        calculated;
        value       $internalField;
    }

    inlet
    {
        type        calculated;
        value       $internalField;
    }

    outlet
    {
        type        calculated;
        value       $internalField;
    }


    FluidProperties_to_heatsink
    {
        type        calculated;
        value       $internalField;
    }

    defaultFaces
    {
        type        calculated;
        value       $internalField;
    }
}

// ************************************************************************* //
