Data/TestFiles/cases/SimpleHeatFin/case/0/heatsink/T
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heatsink";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{
    heatsource001
    {
        type        fixedValue;
        value       uniform 393.0;
    }


    heatsink_to_FluidProperties
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
