Data/TestFiles/cases/SimpleHeatFin/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes      {}
gradSchemes     {}
divSchemes      {}
laplacianSchemes {}
interpolationSchemes {}
snGradSchemes   {}

// ************************************************************************* //
