Data/TestFiles/cases/SimpleHeatFin/case/system/heatsink/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/heatsink";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE
{
    nNonOrthogonalCorrectors 5;

    residualControl
    {
        h               0.001;
    }
}

solvers
{
    h
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.1;
        smoother         symGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    hFinal
    {
        $h;
        relTol          0;
    }
}

relaxationFactors
{
    equations
    {
        h               0.9;
    }
}

// ************************************************************************* //
