Data/TestFiles/cases/SimpleHeatFin/case/system/regionSolvers
regionSolvers
{
    FluidProperties fluid;
    heatsink solid;
}
